function bgm_play(name, ...)
	return a_play(fs_resolve("et:/mods/e17x-bgm/music/" .. name:lower() .. ".adx.ogg"), ...)
end

function bgm_resolve(name)
	name = fs_resolve("et:/mods/e17x-bgm/music/" .. name:lower() .. ".adx.ogg")
	return name
end

function vn_speaker(id, display)
	return {id = id, display = display}
end

local names = {
	[-1] = "",
	[0] = "BW",
	[1] = "Takeshi",
	[2] = "Tsugumi",
	[3] = "Sora",
	[4] = "You",
	[5] = "Kid",
	[6] = "Coco",
	[7] = "Sara",
	[8] = "Pipi",
	[9] = "Researcher",
	[10] = "Suzuki",
	[11] = "Sato",
	[12] = "Staff",
	[13] = "Chami",
	[14] = "Control",
	[15] = "Boy",
	[16] = "???",
	[17] = "Girl",
	[18] = "Lemur",
	[19] = "Lady",
	[20] = "Sora A",
	[21] = "Sora B",
	[22] = "Sora C",
	[23] = "Announcer",
	[24] = "Staff Girl",
	[25] = "I",
	[26] = "Mayo",
	[27] = "Matsunaga",
	[28] = "Popo?",
	[29] = "Man",
	[30] = "Woman",
	[31] = "Puppy",
	[32] = "Teacher",
	[33] = "Doctor",
	[34] = "Gentleman",
	[35] = "Supervisor",
	[36] = "Subordinate",
	[37] = "Professor Morino",
	[38] = "You-Haru",
	[39] = "You-Aki",
	[40] = "Kaburaki",
	[41] = "Hokuto",
	[42] = "Takeshi Yagami",
	[43] = "Yoichi Tanaka",
	[44] = "Dr. Tanaka",
	[45] = "Researcher A",
	[46] = "Researcher B",
	[47] = "Researcher C",
	[48] = "Researcher D",
	[49] = "Researcher E",
	[50] = "Researcher F",
	[51] = "Researcher G",
	[52] = "Control A",
	[53] = "Control B",
	[54] = "Doctor",
	[55] = "Announcer",
	[56] = "Everyone",
	[57] = "Operator",
	[58] = "Labcoat Man",
	[59] = "Voice on TV",
	[60] = "Assistant",
	[61] = "Researcher A",
	[62] = "Researcher B",
	[63] = "Takeshi",
	[64] = "Kid",
	[65] = "Spare",
	[66] = "Kid (Unvoiced)",
	[67] = "Takeshi (Unvoiced)",
	[68] = "Anchorwoman",
	[69] = "Instructor"
}

local model_files = {
	["ココ"] = "KO1",
	["沙羅"] = "SA1",
	["沙羅水着"] = "SA2",
	["空"] = "SO1",
	["空２"] = "SO1",
	["空３"] = "SO1",
	["空４"] = "SO1",
	["空５"] = "SO1",
	["つぐみ"] = "TU1",
	["つぐみ濡れ"] = "TU2",
	["つぐみ３４"] = "TU3",
	--["優"] = "YU1",
	["優私服"] = "YU2",
	["優３４"] = "YH1",
	["武"] = "TA1",
	["偽武"] = "PA1",
	["少年"] = "PB1",
	["ホクト"] = "TB1",
	["みゅみゅーん"] = "MU1",
	["優私服２"] = "MU1"
}

local model_presets = {
	["ココ"] = {},
	["沙羅"] = {},
	["沙羅水着"] = {},
	["空"] = {},
	["空２"] = {},
	["空３"] = {},
	["空４"] = {},
	["空５"] = {},
	["つぐみ"] = {},
	["つぐみ濡れ"] = {},
	["つぐみ３４"] = {},
	["優"] = {},
	["優私服"] = {},
	["優３４"] = {},
	["武"] = {},
	["偽武"] = {},
	["少年"] = {},
	["ホクト"] = {},
	["みゅみゅーん"] = {},
	["優私服２"] = {}
}

model_presets["沙羅"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["沙羅"][1] = {0.0,0.20,0,-6.1,11.9}
model_presets["沙羅"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["沙羅"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["沙羅"][4] = {0.68,0.20,0,-6.1,11.9}
model_presets["沙羅"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["沙羅"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["沙羅"][7] = {-0.68,0.20,0,-6.1,11.9}
model_presets["沙羅"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["沙羅"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["沙羅"][10] = {0.45,0.20,0,-6.1,11.9}
model_presets["沙羅"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["沙羅"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["沙羅"][13] = {-0.45,0.20,0,-6.1,11.9}
model_presets["沙羅"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["沙羅"][15] = {0.0,0.20,0,-6.1,}
model_presets["沙羅"][16] = {0.0,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅"][19] = {0.68,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅"][22] = {-0.68,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅"][25] = {0.45,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅"][28] = {-0.45,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅"][30] = {0.0,0.21,0,-6.1,10.7}
model_presets["沙羅水着"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["沙羅水着"][1] = {0.0,0.20,0,-6.1,11.9}
model_presets["沙羅水着"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["沙羅水着"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["沙羅水着"][4] = {0.68,0.20,0,-6.1,11.9}
model_presets["沙羅水着"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["沙羅水着"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["沙羅水着"][7] = {-0.68,0.20,0,-6.1,11.9}
model_presets["沙羅水着"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["沙羅水着"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["沙羅水着"][10] = {0.45,0.20,0,-6.1,11.9}
model_presets["沙羅水着"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["沙羅水着"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["沙羅水着"][13] = {-0.45,0.20,0,-6.1,11.9}
model_presets["沙羅水着"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["沙羅水着"][15] = {0.0,0.20,0,-6.1,}
model_presets["沙羅水着"][16] = {0.0,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅水着"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅水着"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅水着"][19] = {0.68,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅水着"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅水着"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅水着"][22] = {-0.68,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅水着"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅水着"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅水着"][25] = {0.45,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅水着"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["沙羅水着"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["沙羅水着"][28] = {-0.45,0.20,0,-6.1,11.9,0,180,0}
model_presets["沙羅水着"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["ココ"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["ココ"][1] = {0.0,0.20,0,-6.1,11.8}
model_presets["ココ"][2] = {0.0,0.23,0,-6.1,18.0}
model_presets["ココ"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["ココ"][4] = {0.68,0.20,0,-6.1,11.8}
model_presets["ココ"][5] = {0.68,0.23,0,-6.1,18.0}
model_presets["ココ"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["ココ"][7] = {-0.68,0.20,0,-6.1,11.8}
model_presets["ココ"][8] = {-0.68,0.23,0,-6.1,18.0}
model_presets["ココ"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["ココ"][10] = {0.45,0.20,0,-6.1,11.8}
model_presets["ココ"][11] = {0.45,0.23,0,-6.1,18.0}
model_presets["ココ"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["ココ"][13] = {-0.45,0.20,0,-6.1,11.8}
model_presets["ココ"][14] = {-0.45,0.23,0,-6.1,18.0}
model_presets["ココ"][15] = {0.0,0.20,0,-6.1,}
model_presets["ココ"][16] = {0.0,0.20,0,-6.1,11.8,0,180,0}
model_presets["ココ"][17] = {0.0,0.23,0,-6.1,18.0,0,180,0}
model_presets["ココ"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["ココ"][19] = {0.68,0.20,0,-6.1,11.8,0,180,0}
model_presets["ココ"][20] = {0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["ココ"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["ココ"][22] = {-0.68,0.20,0,-6.1,11.8,0,180,0}
model_presets["ココ"][23] = {-0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["ココ"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["ココ"][25] = {0.45,0.20,0,-6.1,11.8,0,180,0}
model_presets["ココ"][26] = {0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["ココ"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0,-6.0}
model_presets["ココ"][28] = {-0.45,0.20,0,-6.1,11.8,0,180,0,-6.0}
model_presets["ココ"][29] = {-0.45,0.23,0,-6.1,18.0,0,180,0,-6.0}
model_presets["空"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["空"][1] = {0.0,0.26,0,-6.1,11.6}
model_presets["空"][2] = {0.0,0.27,0,-6.1,18.0}
model_presets["空"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["空"][4] = {0.68,0.26,0,-6.1,11.6}
model_presets["空"][5] = {0.68,0.27,0,-6.1,18.0}
model_presets["空"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["空"][7] = {-0.68,0.26,0,-6.1,11.6}
model_presets["空"][8] = {-0.68,0.27,0,-6.1,18.0}
model_presets["空"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["空"][10] = {0.45,0.26,0,-6.1,11.6}
model_presets["空"][11] = {0.45,0.27,0,-6.1,18.0}
model_presets["空"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["空"][13] = {-0.45,0.26,0,-6.1,11.6}
model_presets["空"][14] = {-0.45,0.27,0,-6.1,18.0}
model_presets["空"][15] = {0.0,0.20,0,-6.1,}
model_presets["空"][16] = {0.0,0.26,0,-6.1,11.6,0,180,0}
model_presets["空"][17] = {0.0,0.27,0,-6.1,18.0,0,180,0}
model_presets["空"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空"][19] = {0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空"][20] = {0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空"][22] = {-0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空"][23] = {-0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空"][25] = {0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空"][26] = {0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空"][28] = {-0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空"][29] = {-0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空"][30] = {0.0,0.21,0,-6.1,10.7}
model_presets["つぐみ"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["つぐみ"][1] = {0.0,0.22,0,-6.1,11.7}
model_presets["つぐみ"][2] = {0.0,0.23,0,-6.1,18.0}
model_presets["つぐみ"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["つぐみ"][4] = {0.68,0.22,0,-6.1,11.7}
model_presets["つぐみ"][5] = {0.68,0.23,0,-6.1,18.0}
model_presets["つぐみ"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["つぐみ"][7] = {-0.68,0.22,0,-6.1,11.7}
model_presets["つぐみ"][8] = {-0.68,0.23,0,-6.1,18.0}
model_presets["つぐみ"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["つぐみ"][10] = {0.45,0.22,0,-6.1,11.7}
model_presets["つぐみ"][11] = {0.45,0.23,0,-6.1,18.0}
model_presets["つぐみ"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["つぐみ"][13] = {-0.45,0.22,0,-6.1,11.7}
model_presets["つぐみ"][14] = {-0.45,0.23,0,-6.1,18.0}
model_presets["つぐみ"][15] = {0.0,0.20,0,-6.1,}
model_presets["つぐみ"][16] = {0.0,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ"][17] = {0.0,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ"][19] = {0.68,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ"][20] = {0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ"][22] = {-0.68,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ"][23] = {-0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ"][25] = {0.45,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ"][26] = {0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ"][28] = {-0.45,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ"][29] = {-0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ"][30] = {0.0,0.21,0,-6.1,10.7}
model_presets["つぐみ濡れ"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["つぐみ濡れ"][1] = {0.0,0.22,0,-6.1,11.7}
model_presets["つぐみ濡れ"][2] = {0.0,0.23,0,-6.1,18.0}
model_presets["つぐみ濡れ"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["つぐみ濡れ"][4] = {0.68,0.22,0,-6.1,11.7}
model_presets["つぐみ濡れ"][5] = {0.68,0.23,0,-6.1,18.0}
model_presets["つぐみ濡れ"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["つぐみ濡れ"][7] = {-0.68,0.22,0,-6.1,11.7}
model_presets["つぐみ濡れ"][8] = {-0.68,0.23,0,-6.1,18.0}
model_presets["つぐみ濡れ"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["つぐみ濡れ"][10] = {0.45,0.22,0,-6.1,11.7}
model_presets["つぐみ濡れ"][11] = {0.45,0.23,0,-6.1,18.0}
model_presets["つぐみ濡れ"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["つぐみ濡れ"][13] = {-0.45,0.22,0,-6.1,11.7}
model_presets["つぐみ濡れ"][14] = {-0.45,0.23,0,-6.1,18.0}
model_presets["つぐみ濡れ"][15] = {0.0,0.20,0,-6.1,}
model_presets["つぐみ濡れ"][16] = {0.0,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ濡れ"][17] = {0.0,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ濡れ"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ濡れ"][19] = {0.68,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ濡れ"][20] = {0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ濡れ"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ濡れ"][22] = {-0.68,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ濡れ"][23] = {-0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ濡れ"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ濡れ"][25] = {0.45,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ濡れ"][26] = {0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ濡れ"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ濡れ"][28] = {-0.45,0.22,0,-6.1,11.7,0,180,0}
model_presets["つぐみ濡れ"][29] = {-0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["つぐみ３４"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["つぐみ３４"][1] = {0.0,0.21,0,-6.1,11.6}
model_presets["つぐみ３４"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["つぐみ３４"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["つぐみ３４"][4] = {0.68,0.21,0,-6.1,11.6}
model_presets["つぐみ３４"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["つぐみ３４"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["つぐみ３４"][7] = {-0.68,0.21,0,-6.1,11.6}
model_presets["つぐみ３４"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["つぐみ３４"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["つぐみ３４"][10] = {0.45,0.21,0,-6.1,11.6}
model_presets["つぐみ３４"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["つぐみ３４"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["つぐみ３４"][13] = {-0.45,0.21,0,-6.1,11.6}
model_presets["つぐみ３４"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["つぐみ３４"][15] = {0.0,0.20,0,-6.1,}
model_presets["つぐみ３４"][16] = {0.0,0.21,0,-6.1,11.6,0,180,0}
model_presets["つぐみ３４"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["つぐみ３４"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ３４"][19] = {0.68,0.21,0,-6.1,11.6,0,180,0}
model_presets["つぐみ３４"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["つぐみ３４"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ３４"][22] = {-0.68,0.21,0,-6.1,11.6,0,180,0}
model_presets["つぐみ３４"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["つぐみ３４"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ３４"][25] = {0.45,0.21,0,-6.1,11.6,0,180,0}
model_presets["つぐみ３４"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["つぐみ３４"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["つぐみ３４"][28] = {-0.45,0.21,0,-6.1,11.6,0,180,0}
model_presets["つぐみ３４"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["つぐみ３４"][30] = {0.0,0.21,0,-6.1,10.7}
model_presets["優"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["優"][1] = {0.0,0.21,0,-6.1,12.5}
model_presets["優"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["優"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["優"][4] = {0.68,0.21,0,-6.1,12.5}
model_presets["優"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["優"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["優"][7] = {-0.68,0.21,0,-6.1,12.5}
model_presets["優"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["優"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["優"][10] = {0.45,0.21,0,-6.1,12.5}
model_presets["優"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["優"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["優"][13] = {-0.45,0.21,0,-6.1,12.5}
model_presets["優"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["優"][15] = {0.0,0.20,0,-6.1,}
model_presets["優"][16] = {0.0,0.21,0,-6.1,12.5,0,180,0}
model_presets["優"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["優"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優"][19] = {0.68,0.21,0,-6.1,12.5,0,180,0}
model_presets["優"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優"][22] = {-0.68,0.21,0,-6.1,12.5,0,180,0}
model_presets["優"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優"][25] = {0.45,0.21,0,-6.1,12.5,0,180,0}
model_presets["優"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["優"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優"][28] = {-0.45,0.21,0,-6.1,12.5,0,180,0}
model_presets["優"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["優私服"][1] = {0.0,0.21,0,-6.1,12.5}
model_presets["優私服"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["優私服"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["優私服"][4] = {0.68,0.21,0,-6.1,12.5}
model_presets["優私服"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["優私服"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["優私服"][7] = {-0.68,0.21,0,-6.1,12.5}
model_presets["優私服"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["優私服"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["優私服"][10] = {0.45,0.21,0,-6.1,12.5}
model_presets["優私服"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["優私服"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["優私服"][13] = {-0.45,0.21,0,-6.1,12.5}
model_presets["優私服"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["優私服"][15] = {0.0,0.20,0,-6.1,}
model_presets["優私服"][16] = {0.0,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服"][19] = {0.68,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服"][22] = {-0.68,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服"][25] = {0.45,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服"][28] = {-0.45,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["優３４"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["優３４"][1] = {0.0,0.21,0,-6.1,11.6}
model_presets["優３４"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["優３４"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["優３４"][4] = {0.68,0.21,0,-6.1,11.6}
model_presets["優３４"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["優３４"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["優３４"][7] = {-0.68,0.21,0,-6.1,11.6}
model_presets["優３４"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["優３４"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["優３４"][10] = {0.45,0.21,0,-6.1,11.6}
model_presets["優３４"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["優３４"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["優３４"][13] = {-0.45,0.21,0,-6.1,11.6}
model_presets["優３４"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["優３４"][15] = {0.0,0.20,0,-6.1,}
model_presets["優３４"][16] = {0.0,0.21,0,-6.1,11.6,0,180,0}
model_presets["優３４"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["優３４"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優３４"][19] = {0.68,0.21,0,-6.1,11.6,0,180,0}
model_presets["優３４"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優３４"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優３４"][22] = {-0.68,0.21,0,-6.1,11.6,0,180,0}
model_presets["優３４"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優３４"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優３４"][25] = {0.45,0.21,0,-6.1,11.6,0,180,0}
model_presets["優３４"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["優３４"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優３４"][28] = {-0.45,0.21,0,-6.1,11.6,0,180,0}
model_presets["優３４"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["武"][0] = {0.0,0.30,0,-6.1,9.5}
model_presets["武"][1] = {0.0,0.30,0,-6.1,12.2}
model_presets["武"][2] = {0.0,0.30,0,-6.1,18.0}
model_presets["武"][3] = {0.68,0.30,0,-6.1,9.5}
model_presets["武"][4] = {0.68,0.30,0,-6.1,12.2}
model_presets["武"][5] = {0.68,0.30,0,-6.1,18.0}
model_presets["武"][6] = {-0.68,0.30,0,-6.1,9.5}
model_presets["武"][7] = {-0.68,0.30,0,-6.1,12.2}
model_presets["武"][8] = {-0.68,0.30,0,-6.1,18.0}
model_presets["武"][9] = {0.45,0.30,0,-6.1,9.5}
model_presets["武"][10] = {0.45,0.30,0,-6.1,12.2}
model_presets["武"][11] = {0.45,0.30,0,-6.1,18.0}
model_presets["武"][12] = {-0.45,0.30,0,-6.1,9.5}
model_presets["武"][13] = {-0.45,0.30,0,-6.1,12.2}
model_presets["武"][14] = {-0.45,0.30,0,-6.1,18.0}
model_presets["武"][15] = {0.0,0.30,0,-6.1,}
model_presets["武"][16] = {0.0,0.30,0,-6.1,12.2,0,180,0}
model_presets["武"][17] = {0.0,0.30,0,-6.1,18.0,0,180,0}
model_presets["武"][18] = {0.68,0.30,0,-6.1,9.5,0,180,0}
model_presets["武"][19] = {0.68,0.30,0,-6.1,12.2,0,180,0}
model_presets["武"][20] = {0.68,0.30,0,-6.1,18.0,0,180,0}
model_presets["武"][21] = {-0.68,0.30,0,-6.1,9.5,0,180,0}
model_presets["武"][22] = {-0.68,0.30,0,-6.1,12.2,0,180,0}
model_presets["武"][23] = {-0.68,0.30,0,-6.1,18.0,0,180,0}
model_presets["武"][24] = {0.45,0.30,0,-6.1,9.5,0,180,0}
model_presets["武"][25] = {0.45,0.30,0,-6.1,12.2,0,180,0}
model_presets["武"][26] = {0.45,0.30,0,-6.1,18.0,0,180,0}
model_presets["武"][27] = {-0.45,0.30,0,-6.1,9.5,0,180,0}
model_presets["武"][28] = {-0.45,0.30,0,-6.1,12.2,0,180,0}
model_presets["武"][29] = {-0.45,0.30,0,-6.1,18.0,0,180,0}
model_presets["偽武"][0] = {0.0,0.30,0,-6.1,9.5}
model_presets["偽武"][1] = {0.0,0.35,0,-6.1,12.1}
model_presets["偽武"][2] = {0.0,0.38,0,-6.1,18.0}
model_presets["偽武"][3] = {0.68,0.30,0,-6.1,9.5}
model_presets["偽武"][4] = {0.68,0.35,0,-6.1,12.1}
model_presets["偽武"][5] = {0.68,0.38,0,-6.1,18.0}
model_presets["偽武"][6] = {-0.68,0.30,0,-6.1,9.5}
model_presets["偽武"][7] = {-0.68,0.35,0,-6.1,12.1}
model_presets["偽武"][8] = {-0.68,0.36,0,-6.1,18.0}
model_presets["偽武"][9] = {0.45,0.30,0,-6.1,9.5}
model_presets["偽武"][10] = {0.45,0.35,0,-6.1,12.1}
model_presets["偽武"][11] = {0.45,0.38,0,-6.1,18.0}
model_presets["偽武"][12] = {-0.45,0.30,0,-6.1,9.5}
model_presets["偽武"][13] = {-0.45,0.35,0,-6.1,12.1}
model_presets["偽武"][14] = {-0.45,0.36,0,-6.1,18.0}
model_presets["偽武"][15] = {0.0,0.30,0,-6.1,}
model_presets["偽武"][16] = {0.0,0.35,0,-6.1,12.1,0,180,0}
model_presets["偽武"][17] = {0.0,0.38,0,-6.1,18.0,0,180,0}
model_presets["偽武"][18] = {0.68,0.30,0,-6.1,9.5,0,180,0}
model_presets["偽武"][19] = {0.68,0.35,0,-6.1,12.1,0,180,0}
model_presets["偽武"][20] = {0.68,0.38,0,-6.1,18.0,0,180,0}
model_presets["偽武"][21] = {-0.68,0.30,0,-6.1,9.5,0,180,0}
model_presets["偽武"][22] = {-0.68,0.35,0,-6.1,12.1,0,180,0}
model_presets["偽武"][23] = {-0.68,0.38,0,-6.1,18.0,0,180,0}
model_presets["偽武"][24] = {0.45,0.30,0,-6.1,9.5,0,180,0}
model_presets["偽武"][25] = {0.45,0.35,0,-6.1,12.1,0,180,0}
model_presets["偽武"][26] = {0.45,0.38,0,-6.1,18.0,0,180,0}
model_presets["偽武"][27] = {-0.45,0.30,0,-6.1,9.5,0,180,0}
model_presets["偽武"][28] = {-0.45,0.35,0,-6.1,12.1,0,180,0}
model_presets["偽武"][29] = {-0.45,0.38,0,-6.1,18.0,0,180,0}
model_presets["少年"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["少年"][1] = {0.0,0.20,0,-6.1,12.5}
model_presets["少年"][2] = {0.0,0.23,0,-6.1,18.0}
model_presets["少年"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["少年"][4] = {0.68,0.20,0,-6.1,12.5}
model_presets["少年"][5] = {0.68,0.23,0,-6.1,18.0}
model_presets["少年"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["少年"][7] = {-0.68,0.20,0,-6.1,12.5}
model_presets["少年"][8] = {-0.68,0.23,0,-6.1,18.0}
model_presets["少年"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["少年"][10] = {0.45,0.20,0,-6.1,12.5}
model_presets["少年"][11] = {0.45,0.23,0,-6.1,18.0}
model_presets["少年"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["少年"][13] = {-0.45,0.20,0,-6.1,12.5}
model_presets["少年"][14] = {-0.45,0.23,0,-6.1,18.0}
model_presets["少年"][15] = {0.0,0.20,0,-6.1,}
model_presets["少年"][16] = {0.0,0.20,0,-6.1,12.5,0,180,0}
model_presets["少年"][17] = {0.0,0.23,0,-6.1,18.0,0,180,0}
model_presets["少年"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["少年"][19] = {0.68,0.20,0,-6.1,12.5,0,180,0}
model_presets["少年"][20] = {0.68,0.23,0,-6,1,18.0,0,180,0}
model_presets["少年"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["少年"][22] = {-0.68,0.20,0,-6.1,12.5,0,180,0}
model_presets["少年"][23] = {-0.68,0.23,0,-6.1,18.0,0,180,0}
model_presets["少年"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["少年"][25] = {0.45,0.20,0,-6.1,12.5,0,180,0}
model_presets["少年"][26] = {0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["少年"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["少年"][28] = {-0.45,0.20,0,-6.1,12.5,0,180,0}
model_presets["少年"][29] = {-0.45,0.23,0,-6.1,18.0,0,180,0}
model_presets["ホクト"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["ホクト"][1] = {0.0,0.20,0,-6.1,11.8}
model_presets["ホクト"][2] = {0.0,0.21,0,-6.1,18.0}
model_presets["ホクト"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["ホクト"][4] = {0.68,0.20,0,-6.1,11.8}
model_presets["ホクト"][5] = {0.68,0.21,0,-6.1,18.0}
model_presets["ホクト"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["ホクト"][7] = {-0.68,0.20,0,-6.1,11.8}
model_presets["ホクト"][8] = {-0.68,0.21,0,-6.1,18.0}
model_presets["ホクト"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["ホクト"][10] = {0.45,0.20,0,-6.1,11.8}
model_presets["ホクト"][11] = {0.45,0.21,0,-6.1,18.0}
model_presets["ホクト"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["ホクト"][13] = {-0.45,0.20,0,-6.1,11.8}
model_presets["ホクト"][14] = {-0.45,0.21,0,-6.1,18.0}
model_presets["ホクト"][15] = {0.0,0.20,0,-6.1,}
model_presets["ホクト"][16] = {0.0,0.20,0,-6.1,11.8,0,180,0}
model_presets["ホクト"][17] = {0.0,0.21,0,-6.1,18.0,0,180,0}
model_presets["ホクト"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["ホクト"][19] = {0.68,0.20,0,-6.1,11.8,0,180,0}
model_presets["ホクト"][20] = {0.68,0.21,0,-6.1,18.0,0,180,0}
model_presets["ホクト"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["ホクト"][22] = {-0.68,0.20,0,-6.1,11.8,0,180,0}
model_presets["ホクト"][23] = {-0.68,0.21,0,-6.1,18.0,0,180,0}
model_presets["ホクト"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["ホクト"][25] = {0.45,0.20,0,-6.1,11.8,0,180,0}
model_presets["ホクト"][26] = {0.45,0.21,0,-6.1,18.0,0,180,0}
model_presets["ホクト"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["ホクト"][28] = {-0.45,0.20,0,-6.1,11.8,0,180,0}
model_presets["ホクト"][29] = {-0.45,0.21,0,-6.1,18.0,0,180,0}
model_presets["みゅみゅーん"][0] = {0.0,0.15,0,-6.1,12.5}
model_presets["みゅみゅーん"][1] = {0.0,0.15,0,-6.1,13.5}
model_presets["みゅみゅーん"][2] = {0.0,0.24,0,-6.1,21.0}
model_presets["みゅみゅーん"][3] = {0.68,0.15,0,-6.1,11.5}
model_presets["みゅみゅーん"][4] = {0.68,0.15,0,-6.1,13.5}
model_presets["みゅみゅーん"][5] = {0.68,0.24,0,-6.1,21.0}
model_presets["みゅみゅーん"][6] = {-0.68,0.15,0,-6.1,12.0}
model_presets["みゅみゅーん"][7] = {-0.68,0.15,0,-6.1,13.5}
model_presets["みゅみゅーん"][8] = {-0.68,0.24,0,-6.1,21.0}
model_presets["みゅみゅーん"][9] = {0.45,0.15,0,-6.1,12.0}
model_presets["みゅみゅーん"][10] = {0.45,0.15,0,-6.1,13.5}
model_presets["みゅみゅーん"][11] = {0.45,0.24,0,-6.1,21.0}
model_presets["みゅみゅーん"][12] = {-0.45,0.15,0,-6.1,12.0}
model_presets["みゅみゅーん"][13] = {-0.45,0.15,0,-6.1,13.5}
model_presets["みゅみゅーん"][14] = {-0.45,0.24,0,-6.1,21.0}
model_presets["みゅみゅーん"][15] = {0.0,0.15,0,-6.1,12.5,0,180,0}
model_presets["みゅみゅーん"][16] = {0.0,0.15,0,-6.1,13.5,0,180,0}
model_presets["みゅみゅーん"][17] = {0.0,0.24,0,-6.1,21.0,0,180,0}
model_presets["みゅみゅーん"][18] = {0.68,0.15,0,-6.1,12.0,0,180,0}
model_presets["みゅみゅーん"][19] = {0.68,0.15,0,-6.1,13.5,0,180,0}
model_presets["みゅみゅーん"][20] = {0.68,0.24,0,-6.1,21.0,0,180,0}
model_presets["みゅみゅーん"][21] = {-0.68,0.15,0,-6.1,12.0,0,180,0}
model_presets["みゅみゅーん"][22] = {-0.68,0.15,0,-6.1,13.5,0,180,0}
model_presets["みゅみゅーん"][23] = {-0.68,0.24,0,-6.1,21.0,0,180,0}
model_presets["みゅみゅーん"][24] = {0.45,0.15,0,-6.1,12.0,0,180,0}
model_presets["みゅみゅーん"][25] = {0.45,0.15,0,-6.1,13.5,0,180,0}
model_presets["みゅみゅーん"][26] = {0.45,0.24,0,-6.1,21.0,0,180,0}
model_presets["みゅみゅーん"][27] = {-0.45,0.15,0,-6.1,12.0,0,180,0}
model_presets["みゅみゅーん"][28] = {-0.45,0.15,0,-6.1,13.5,0,180,0}
model_presets["みゅみゅーん"][29] = {-0.45,0.24,0,-6.1,21.0,0,180,0}
model_presets["みゅみゅーん"][30] = {0.0,0.15,0,-6.1,16,0,180,0}
model_presets["空２"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["空２"][1] = {0.0,0.26,0,-6.1,11.6}
model_presets["空２"][2] = {0.0,0.27,0,-6.1,18.0}
model_presets["空２"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["空２"][4] = {0.68,0.26,0,-6.1,11.6}
model_presets["空２"][5] = {0.68,0.27,0,-6.1,18.0}
model_presets["空２"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["空２"][7] = {-0.68,0.26,0,-6.1,11.6}
model_presets["空２"][8] = {-0.68,0.27,0,-6.1,18.0}
model_presets["空２"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["空２"][10] = {0.45,0.26,0,-6.1,11.6}
model_presets["空２"][11] = {0.45,0.27,0,-6.1,18.0}
model_presets["空２"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["空２"][13] = {-0.45,0.26,0,-6.1,11.6}
model_presets["空２"][14] = {-0.45,0.27,0,-6.1,18.0}
model_presets["空２"][15] = {0.0,0.20,0,-6.1,}
model_presets["空２"][16] = {0.0,0.26,0,-6.1,11.6,0,180,0}
model_presets["空２"][17] = {0.0,0.27,0,-6.1,18.0,0,180,0}
model_presets["空２"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空２"][19] = {0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空２"][20] = {0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空２"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空２"][22] = {-0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空２"][23] = {-0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空２"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空２"][25] = {0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空２"][26] = {0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空２"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空２"][28] = {-0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空２"][29] = {-0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空３"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["空３"][1] = {0.0,0.26,0,-6.1,11.6}
model_presets["空３"][2] = {0.0,0.27,0,-6.1,18.0}
model_presets["空３"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["空３"][4] = {0.68,0.26,0,-6.1,11.6}
model_presets["空３"][5] = {0.68,0.27,0,-6.1,18.0}
model_presets["空３"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["空３"][7] = {-0.68,0.26,0,-6.1,11.6}
model_presets["空３"][8] = {-0.68,0.27,0,-6.1,18.0}
model_presets["空３"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["空３"][10] = {0.45,0.26,0,-6.1,11.6}
model_presets["空３"][11] = {0.45,0.27,0,-6.1,18.0}
model_presets["空３"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["空３"][13] = {-0.45,0.26,0,-6.1,11.6}
model_presets["空３"][14] = {-0.45,0.27,0,-6.1,18.0}
model_presets["空３"][15] = {0.0,0.20,0,-6.1,}
model_presets["空３"][16] = {0.0,0.26,0,-6.1,11.6,0,180,0}
model_presets["空３"][17] = {0.0,0.27,0,-6.1,18.0,0,180,0}
model_presets["空３"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空３"][19] = {0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空３"][20] = {0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空３"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空３"][22] = {-0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空３"][23] = {-0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空３"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空３"][25] = {0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空３"][26] = {0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空３"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空３"][28] = {-0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空３"][29] = {-0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空４"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["空４"][1] = {0.0,0.26,0,-6.1,11.6}
model_presets["空４"][2] = {0.0,0.27,0,-6.1,18.0}
model_presets["空４"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["空４"][4] = {0.68,0.26,0,-6.1,11.6}
model_presets["空４"][5] = {0.68,0.27,0,-6.1,18.0}
model_presets["空４"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["空４"][7] = {-0.68,0.26,0,-6.1,11.6}
model_presets["空４"][8] = {-0.68,0.27,0,-6.1,18.0}
model_presets["空４"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["空４"][10] = {0.45,0.26,0,-6.1,11.6}
model_presets["空４"][11] = {0.45,0.27,0,-6.1,18.0}
model_presets["空４"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["空４"][13] = {-0.45,0.26,0,-6.1,11.6}
model_presets["空４"][14] = {-0.45,0.27,0,-6.1,18.0}
model_presets["空４"][15] = {0.0,0.20,0,-6.1,}
model_presets["空４"][16] = {0.0,0.26,0,-6.1,11.6,0,180,0}
model_presets["空４"][17] = {0.0,0.27,0,-6.1,18.0,0,180,0}
model_presets["空４"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空４"][19] = {0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空４"][20] = {0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空４"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空４"][22] = {-0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空４"][23] = {-0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空４"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空４"][25] = {0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空４"][26] = {0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空４"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空４"][28] = {-0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空４"][29] = {-0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空５"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["空５"][1] = {0.0,0.26,0,-6.1,11.6}
model_presets["空５"][2] = {0.0,0.27,0,-6.1,18.0}
model_presets["空５"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["空５"][4] = {0.68,0.26,0,-6.1,11.6}
model_presets["空５"][5] = {0.68,0.27,0,-6.1,18.0}
model_presets["空５"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["空５"][7] = {-0.68,0.26,0,-6.1,11.6}
model_presets["空５"][8] = {-0.68,0.27,0,-6.1,18.0}
model_presets["空５"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["空５"][10] = {0.45,0.26,0,-6.1,11.6}
model_presets["空５"][11] = {0.45,0.27,0,-6.1,18.0}
model_presets["空５"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["空５"][13] = {-0.45,0.26,0,-6.1,11.6}
model_presets["空５"][14] = {-0.45,0.27,0,-6.1,18.0}
model_presets["空５"][15] = {0.0,0.20,0,-6.1,}
model_presets["空５"][16] = {0.0,0.26,0,-6.1,11.6,0,180,0}
model_presets["空５"][17] = {0.0,0.27,0,-6.1,18.0,0,180,0}
model_presets["空５"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空５"][19] = {0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空５"][20] = {0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空５"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["空５"][22] = {-0.68,0.26,0,-6.1,11.6,0,180,0}
model_presets["空５"][23] = {-0.68,0.27,0,-6.1,18.0,0,180,0}
model_presets["空５"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空５"][25] = {0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空５"][26] = {0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空５"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["空５"][28] = {-0.45,0.26,0,-6.1,11.6,0,180,0}
model_presets["空５"][29] = {-0.45,0.27,0,-6.1,18.0,0,180,0}
model_presets["空５"][30] = {0.0,0.21,0,-6.1,10.7}
model_presets["優私服２"][0] = {0.0,0.20,0,-6.1,9.5}
model_presets["優私服２"][1] = {0.0,0.21,0,-6.1,12.5}
model_presets["優私服２"][2] = {0.0,0.22,0,-6.1,18.0}
model_presets["優私服２"][3] = {0.68,0.20,0,-6.1,9.5}
model_presets["優私服２"][4] = {0.68,0.21,0,-6.1,12.5}
model_presets["優私服２"][5] = {0.68,0.22,0,-6.1,18.0}
model_presets["優私服２"][6] = {-0.68,0.20,0,-6.1,9.5}
model_presets["優私服２"][7] = {-0.68,0.21,0,-6.1,12.5}
model_presets["優私服２"][8] = {-0.68,0.22,0,-6.1,18.0}
model_presets["優私服２"][9] = {0.45,0.20,0,-6.1,9.5}
model_presets["優私服２"][10] = {0.45,0.21,0,-6.1,12.5}
model_presets["優私服２"][11] = {0.45,0.22,0,-6.1,18.0}
model_presets["優私服２"][12] = {-0.45,0.20,0,-6.1,9.5}
model_presets["優私服２"][13] = {-0.45,0.21,0,-6.1,12.5}
model_presets["優私服２"][14] = {-0.45,0.22,0,-6.1,18.0}
model_presets["優私服２"][15] = {0.0,0.20,0,-6.1,}
model_presets["優私服２"][16] = {0.0,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服２"][17] = {0.0,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服２"][18] = {0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服２"][19] = {0.68,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服２"][20] = {0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服２"][21] = {-0.68,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服２"][22] = {-0.68,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服２"][23] = {-0.68,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服２"][24] = {0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服２"][25] = {0.45,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服２"][26] = {0.45,0.22,0,-6.1,18.0,0,180,0}
model_presets["優私服２"][27] = {-0.45,0.20,0,-6.1,9.5,0,180,0}
model_presets["優私服２"][28] = {-0.45,0.21,0,-6.1,12.5,0,180,0}
model_presets["優私服２"][29] = {-0.45,0.22,0,-6.1,18.0,0,180,0}

function e17_xbox_add_character(id)
end

local function effect_quake(img, draw)
	g_push()
	g_translate(oscillate(4) * img.quaking, 0)
	draw(img)
	g_pop()
end

local function remove_comment(line)
	local comment = line:find("%s*//")
	if comment then
		line = line:sub(1, comment - 1)
	end
	return line
end

function parse_script(scr, game_screen)
	local res = {cmds = {}, labels = {}}
	local lines = scr:split("\n")
	--scr = nil
	local linec = #lines
	local i = 1
	while i < linec do
		local line = remove_comment(lines[i])
		local taskn = line:match("%[Task([0-9]+)%]")
		if taskn then
			line = remove_comment(lines[i + 2])
			local tasktype = line:match(":Tasktype%s+\"(.+)\"")
			i = i + 3
			local attr = {id = tonumber(taskn)}
			local texture -- treat :Texture specially because the filename is always included in a comment
			repeat
				line = remove_comment(lines[i])
				local key, val = line:match(":([A-Za-z]+)%s+(.-)%s*$")
				if key then
					if key == "Texture" or key == "BGM" or key == "SE" or key == "Voice" then
						texture = lines[i]:match("<<([a-zA-Z0-9_]+)>>")
					elseif key == "Time" and val == "1" then
						val = "0"
					elseif key == "FadeIn" then -- and val == "1" then
						--val = "0" --val = "30"
					end
					attr[key] = val
				end
				i = i + 1
			until lines[i]:match("^%s*}%s*$")
			if tasktype == "Message" then
				if attr.Frame == "-1" then
					res.cmds[#res.cmds + 1] = {"frame", kind = "nvl"}
				elseif attr.Frame == "0" then
					res.cmds[#res.cmds + 1] = {"frame", kind = 0}
				elseif attr.Frame == "1" then
					res.cmds[#res.cmds + 1] = {"frame", kind = 1}
				elseif attr.Frame == "2" then
					res.cmds[#res.cmds + 1] = {"frame", kind = 2}
				end
				local char = attr.Character and tonumber(attr.Character) or -1
				local name = attr.Name and tonumber(attr.Name) or char
				res.cmds[#res.cmds + 1] = {
					"msg",
					msg = attr.Message:sub(2, -2):gsub("\\n", "\n"):gsub("¥n", "\n"),
					speaker = vn_speaker(char, names[name] or names[-1]),
					voice = attr.Voice and ("et:/user/e17x/voice/" .. texture:upper() .. ".ahx.wav"),
					midprint = attr.ChangingPage == "0",
					clear_after = attr.ChangingPage == "1"
				}
			elseif tasktype == "TimeWait" then
				res.cmds[#res.cmds + 1] = {"delay", tonumber(attr.Time) / 30}
			-- effects
			elseif tasktype == "SpriteQuake" then
				local p1, p2, p3, p4, p5, p6 = attr.Param:match("([0-9]+),([0-9]+),([0-9]+),([0-9]+),([0-9]+),([0-9]+)")
				p1, p2, p3, p4, p5, p6 = tonumber(p1), tonumber(p2), tonumber(p3), tonumber(p4), tonumber(p5), tonumber(p6)
				res.cmds[#res.cmds + 1] = {
					"effect",
					name = "quake",
					img_id = attr.SpriteNumber,
					data = {speed_x = p5, speed_y = p6, x = p3, y = p4, off_x = 0, off_y = 0}
				}
			elseif tasktype == "EffectQuake" then
				local p1, p2, p3, p4, p5, p6 = attr.Param:match("([0-9]+),([0-9]+),([0-9]+),([0-9]+),([0-9]+),([0-9]+)")
				p1, p2, p3, p4, p5, p6 = tonumber(p1), tonumber(p2), tonumber(p3), tonumber(p4), tonumber(p5), tonumber(p6)
				res.cmds[#res.cmds + 1] = {
					"effect",
					name = "quake",
					data = {
						speed_x = p5, speed_y = p6, --speed_x = p5, speed_y = p6,
						x = p3, y = p4,
						off_x = 0, off_y = 0,
						time = attr.Time and (tonumber(attr.Time) / 60) or nil
					}
				}
			elseif tasktype == "EffectQuakeEnd" then
				res.cmds[#res.cmds + 1] = {"effect_rm", name = "quake"}
			elseif tasktype == "Flash" then
				local r, g, b, a = attr.Color:match("([0-9]+),([0-9]+),([0-9]+),([0-9]+)")
				r, g, b, a = tonumber(r) / 255, tonumber(g) / 255, tonumber(b) / 255, tonumber(a) / 255
				res.cmds[#res.cmds + 1] = {
					"effect",
					name = "flash",
					data = {
						r = r, g = g, b = b, a = a,
						in_time = tonumber(attr.InTime) / 60,
						out_time = tonumber(attr.OutTime) / 60,
						wait = tonumber(attr.TimeWait or 0) / 60,
						time = (not attr.TimeWait) and ((tonumber(attr.InTime) + tonumber(attr.OutTime)) / 60)
					}
				}
			elseif tasktype == "FlashStop" then
				res.cmds[#res.cmds + 1] = {"effect_rm", name = "flash"}
			-- visual
			elseif tasktype == "ChrModelOpen" then
				local src = model_files[attr.Name:sub(2, -2)]
				if src then
					res.cmds[#res.cmds + 1] = {
						"img",
						src = src,
						id = attr.Name,
						draw = game_screen.draw_model, args = {game_screen, src, model_presets[attr.Name:sub(2, -2)][tonumber(attr.Preset)]},
						--x = tonumber(x) - 640, y = tonumber(y) - 360, w = -1, h = -1,
						corner = G_CENTER, origin = G_CENTER,
						priority = tonumber(attr.Priority),
						fade_in = attr.FadeIn and (tonumber(attr.Time or 30) / 60) or 0,
						fade_wait = attr.FadeWait ~= "0",
						tags = {"sprite", "all"}
					}
				end
			elseif tasktype == "ChrModelLight" then
				local diffuse = {attr.Diffuse:match("([0-9.]+),([0-9.]+),([0-9.]+),")}
				for i = 1, 3 do
					diffuse[i] = tonumber(diffuse[i]) / 255
				end
				local ambient = {attr.Ambient:match("([0-9.]+),([0-9.]+),([0-9.]+),")}
				for i = 1, 3 do
					ambient[i] = tonumber(ambient[i]) / 255
				end
				local spec = {attr.Spec:match("([0-9.]+),([0-9.]+),([0-9.]+),")}
				local angle_x, angle_y = attr.Angle:match("(%-?[0-9.]+),(%-?[0-9.]+)")
				res.cmds[#res.cmds + 1] = {
					"set",
					var = "model_light",
					val = {Diffuse = diffuse, Ambient = ambient, Spec = spec,
						AngleX = math.rad(tonumber(angle_x)), AngleY = math.rad(tonumber(angle_y))}
				}
			elseif tasktype == "ChrModelClose" then
				if attr.Name then
					res.cmds[#res.cmds + 1] = {
						"img_rm",
						id = attr.Name,
						fade_time = attr.Fade == "1" and (tonumber(attr.Time or 30) / 60) or 0,
						fade_wait = true --attr.FadeWait == "1"
					}
				else
					res.cmds[#res.cmds + 1] = {
						"img_rm_tag",
						tag = "sprite",
						fade_time = attr.Fade == "1" and (tonumber(attr.Time or 30) / 60) or 0,
						fade_wait = true --attr.FadeWait == "1"
					}
				end
			elseif tasktype == "Sprite" or tasktype == "SpriteBG" then
				texture = texture:upper()
				if fs_exists("et:/user/e17x/CG.afs:" .. texture .. ".png") or fs_exists("xbox/bg_psp/" .. texture .. ".png") then
					local x, y = attr.Position:match("([0-9]+),([0-9]+)")
					res.cmds[#res.cmds + 1] = {
						"img",
						src = texture,
						id = attr.Texture,
						x = tonumber(x) - 640, y = tonumber(y) - 360, w = -1, h = -1,
						corner = G_CENTER, origin = G_CENTER,
						priority = tonumber(attr.Priority),
						fade_in = attr.FadeIn and (tonumber(attr.Time or 30) / 60) or 0,
						fade_wait = attr.FadeWait ~= "0",
						tags = tasktype == "SpriteBG" and {"all", "bg"} or {"all"}
					}
					if attr.SpriteDelete == "1" then
						res.cmds[#res.cmds + 1] = {
							"img_set_tags", id = attr.Texture, tags = {}
						}
						res.cmds[#res.cmds + 1] = {
							"img_rm_tag", tag = tasktype == "SpriteBG" and "bg" or "all"
						}
						res.cmds[#res.cmds + 1] = {
							"img_set_tags", id = attr.Texture, tags = tasktype == "SpriteBG" and {"all", "bg"} or {"all"}
						}
					end
				else
					log_err("texture not found " .. texture)
				end
			elseif tasktype == "SpriteDelete" then
				res.cmds[#res.cmds + 1] = {
					"img_rm",
					id = attr.SpriteNumber,
					fade_time = attr.FadeOut == "1" and (tonumber(attr.Time or 30) / 60) or 0,
					fade_wait = attr.FadeWait == "1"
				}
			elseif tasktype == "SpriteDeleteBG" then
				res.cmds[#res.cmds + 1] = {
					"img_rm",
					id = attr.SpriteNumber,
					fade_time = attr.FadeOut == "1" and (tonumber(attr.Time or 30) / 60) or 0,
					fade_wait = attr.FadeWait == "1"
				}
			elseif tasktype == "FadeOut" then
				local r, g, b, a = attr.Color:match("([0-9]+),([0-9]+),([0-9]+),([0-9]+)")
				res.cmds[#res.cmds + 1] = {
					"fadeout",
					r = tonumber(r) / 255, g = tonumber(g) / 255, b = tonumber(b) / 255, a = tonumber(a) / 255,
					time = tonumber(attr.Time or "30") / 60
				}
				if attr.SpriteDelete == "1" then
					res.cmds[#res.cmds + 1] = {
						"img_rm_tag",
						tag = "all"
					}
				end
			elseif tasktype == "FadeIn" then
				if attr.SpriteDelete == "1" then
					res.cmds[#res.cmds + 1] = {
						"img_rm_tag",
						tag = "all"
					}
				end
				local r, g, b, a = attr.Color:match("([0-9]+),([0-9]+),([0-9]+),([0-9]+)")
				res.cmds[#res.cmds + 1] = {
					"fadein",
					r = tonumber(r) / 255, g = tonumber(g) / 255, b = tonumber(b) / 255, a = tonumber(a) / 255,
					time = tonumber(attr.Time or "30") / 60
				}
			elseif tasktype == "SpriteMove" then
				local x, y = attr.Position:match("([0-9]+),([0-9]+)")
				res.cmds[#res.cmds + 1] = {
					"img_move",
					id = attr.SpriteNumber,
					x = tonumber(x) - 640, y = tonumber(y) - 360,
					scale = tonumber(attr.Scale) or nil,
					time = attr.Wait == "1" and (tonumber(attr.Time) / 60) or 0
				}
			-- sound
			elseif tasktype == "BgmPlay" then
				local bgm_path = bgm_resolve(texture:lower())
				print(bgm_path)
				if fs_exists(bgm_path) then
					res.cmds[#res.cmds + 1] = {
						"bgm",
						src = bgm_path,
						id = attr.BGM
					}
				end
			elseif tasktype == "BgmStop" then
				res.cmds[#res.cmds + 1] = {"bgm_stop"}
			elseif tasktype == "SePlay" then
				texture = texture:lower()
				if fs_exists("xbox/se/" .. texture .. ".adx.ogg") then
					res.cmds[#res.cmds + 1] = {
						"sfx",
						src = "xbox/se/" .. texture .. ".adx.ogg",
						id = attr.SE
					}
				end
			elseif tasktype == "SeStop" then
				res.cmds[#res.cmds + 1] = {"sfx_stop", id = attr.SE}
			-- control flow
			elseif tasktype == "Tag" then
				res.labels[attr.Name:sub(2, -2)] = #res.cmds
			elseif tasktype == "Jump_Tag" then
				res.cmds[#res.cmds + 1] = {"jump", label = attr.NextTag:sub(2, -2)}
			elseif tasktype == "NextScene" then
				local file, tag = attr.NextScene:match("\"(.-)\",\"(.-)\"")
				if file then
					res.cmds[#res.cmds + 1] = {"jump", path = "script_en/" .. file, label = tag}
				else
					res.cmds[#res.cmds + 1] = {"jump", path = "script_en/" .. attr.NextScene:sub(2, -2)}
				end
			end
		else
			i = i + 1
		end
	end
	return res
end
